STMicroelectronics/stm32ai-modelzoo/human_activity_recognition/getting_started/Drivers/BSP/Components/ism330dhcx/ism330dhcx_reg.h
/*
 * These are the basic platform dependent I/O routines to read
 * and write device registers connected on a standard bus.
 * The driver keeps offering a default implementation based on function
 * pointers to read/write routines for backward compatibility.
 * The __weak directive allows the final application to overwrite
 * them with a custom implementation.
 */
int32_t ism330dhcx_read_reg(stmdev_ctx_t *ctx, uint8_t reg,
                            uint8_t *data,
                            uint16_t len);
int32_t ism330dhcx_write_reg(stmdev_ctx_t *ctx, uint8_t reg,
                             uint8_t *data,
                             uint16_t len);

float_t ism330dhcx_from_fs2g_to_mg(int16_t lsb);
float_t ism330dhcx_from_fs4g_to_mg(int16_t lsb);
float_t ism330dhcx_from_fs8g_to_mg(int16_t lsb);
float_t ism330dhcx_from_fs16g_to_mg(int16_t lsb);

float_t ism330dhcx_from_fs125dps_to_mdps(int16_t lsb);
float_t ism330dhcx_from_fs250dps_to_mdps(int16_t lsb);
float_t ism330dhcx_from_fs500dps_to_mdps(int16_t lsb);
float_t ism330dhcx_from_fs1000dps_to_mdps(int16_t lsb);
float_t ism330dhcx_from_fs2000dps_to_mdps(int16_t lsb);
float_t ism330dhcx_from_fs4000dps_to_mdps(int16_t lsb);

float_t ism330dhcx_from_lsb_to_celsius(int16_t lsb);

float_t ism330dhcx_from_lsb_to_nsec(int32_t lsb);

typedef enum
{
  ISM330DHCX_2g   = 0,
  ISM330DHCX_16g  = 1, /* if XL_FS_MODE = '1' -> ISM330DHCX_2g */
  ISM330DHCX_4g   = 2,
  ISM330DHCX_8g   = 3,
} ism330dhcx_fs_xl_t;
int32_t ism330dhcx_xl_full_scale_set(stmdev_ctx_t *ctx,
                                     ism330dhcx_fs_xl_t val);
int32_t ism330dhcx_xl_full_scale_get(stmdev_ctx_t *ctx,
                                     ism330dhcx_fs_xl_t *val);

typedef enum
{
  ISM330DHCX_XL_ODR_OFF    = 0,
  ISM330DHCX_XL_ODR_12Hz5  = 1,
  ISM330DHCX_XL_ODR_26Hz   = 2,
  ISM330DHCX_XL_ODR_52Hz   = 3,
  ISM330DHCX_XL_ODR_104Hz  = 4,
  ISM330DHCX_XL_ODR_208Hz  = 5,
  ISM330DHCX_XL_ODR_416Hz  = 6,
  ISM330DHCX_XL_ODR_833Hz  = 7,
  ISM330DHCX_XL_ODR_1666Hz = 8,
  ISM330DHCX_XL_ODR_3332Hz = 9,
  ISM330DHCX_XL_ODR_6667Hz = 10,
  ISM330DHCX_XL_ODR_1Hz6   = 11, /* (low power only) */
} ism330dhcx_odr_xl_t;
int32_t ism330dhcx_xl_data_rate_set(stmdev_ctx_t *ctx,
                                    ism330dhcx_odr_xl_t val);
int32_t ism330dhcx_xl_data_rate_get(stmdev_ctx_t *ctx,
                                    ism330dhcx_odr_xl_t *val);

typedef enum
{
  ISM330DHCX_125dps = 2,
  ISM330DHCX_250dps = 0,
  ISM330DHCX_500dps = 4,
  ISM330DHCX_1000dps = 8,
  ISM330DHCX_2000dps = 12,
  ISM330DHCX_4000dps = 1,
} ism330dhcx_fs_g_t;
int32_t ism330dhcx_gy_full_scale_set(stmdev_ctx_t *ctx,
                                     ism330dhcx_fs_g_t val);
int32_t ism330dhcx_gy_full_scale_get(stmdev_ctx_t *ctx,
                                     ism330dhcx_fs_g_t *val);

typedef enum
{
  ISM330DHCX_GY_ODR_OFF    = 0,
  ISM330DHCX_GY_ODR_12Hz5  = 1,
  ISM330DHCX_GY_ODR_26Hz   = 2,
  ISM330DHCX_GY_ODR_52Hz   = 3,
  ISM330DHCX_GY_ODR_104Hz  = 4,
  ISM330DHCX_GY_ODR_208Hz  = 5,
  ISM330DHCX_GY_ODR_416Hz  = 6,
  ISM330DHCX_GY_ODR_833Hz  = 7,
  ISM330DHCX_GY_ODR_1666Hz = 8,
  ISM330DHCX_GY_ODR_3332Hz = 9,
  ISM330DHCX_GY_ODR_6667Hz = 10,
} ism330dhcx_odr_g_t;
int32_t ism330dhcx_gy_data_rate_set(stmdev_ctx_t *ctx,
                                    ism330dhcx_odr_g_t val);
int32_t ism330dhcx_gy_data_rate_get(stmdev_ctx_t *ctx,
                                    ism330dhcx_odr_g_t *val);

int32_t ism330dhcx_block_data_update_set(stmdev_ctx_t *ctx,
                                         uint8_t val);
int32_t ism330dhcx_block_data_update_get(stmdev_ctx_t *ctx,
                                         uint8_t *val);

typedef enum
{
  ISM330DHCX_LSb_1mg  = 0,
  ISM330DHCX_LSb_16mg = 1,
} ism330dhcx_usr_off_w_t;
int32_t ism330dhcx_xl_offset_weight_set(stmdev_ctx_t *ctx,
                                        ism330dhcx_usr_off_w_t val);
int32_t ism330dhcx_xl_offset_weight_get(stmdev_ctx_t *ctx,
                                        ism330dhcx_usr_off_w_t *val);

typedef enum
{
  ISM330DHCX_HIGH_PERFORMANCE_MD  = 0,
  ISM330DHCX_LOW_NORMAL_POWER_MD  = 1,
} ism330dhcx_xl_hm_mode_t;
int32_t ism330dhcx_xl_power_mode_set(stmdev_ctx_t *ctx,
                                     ism330dhcx_xl_hm_mode_t val);
int32_t ism330dhcx_xl_power_mode_get(stmdev_ctx_t *ctx,
                                     ism330dhcx_xl_hm_mode_t *val);

typedef enum
{
  ISM330DHCX_GY_HIGH_PERFORMANCE  = 0,
  ISM330DHCX_GY_NORMAL            = 1,
} ism330dhcx_g_hm_mode_t;
int32_t ism330dhcx_gy_power_mode_set(stmdev_ctx_t *ctx,
                                     ism330dhcx_g_hm_mode_t val);
int32_t ism330dhcx_gy_power_mode_get(stmdev_ctx_t *ctx,
                                     ism330dhcx_g_hm_mode_t *val);

typedef struct
{
  ism330dhcx_all_int_src_t       all_int_src;
  ism330dhcx_wake_up_src_t       wake_up_src;
  ism330dhcx_tap_src_t           tap_src;
  ism330dhcx_d6d_src_t           d6d_src;
  ism330dhcx_status_reg_t        status_reg;
  ism330dhcx_emb_func_status_t   emb_func_status;
  ism330dhcx_fsm_status_a_t      fsm_status_a;
  ism330dhcx_fsm_status_b_t      fsm_status_b;
} ism330dhcx_all_sources_t;
int32_t ism330dhcx_all_sources_get(stmdev_ctx_t *ctx,
                                   ism330dhcx_all_sources_t *val);

int32_t ism330dhcx_status_reg_get(stmdev_ctx_t *ctx,
                                  ism330dhcx_status_reg_t *val);

int32_t ism330dhcx_xl_flag_data_ready_get(stmdev_ctx_t *ctx,
                                          uint8_t *val);

int32_t ism330dhcx_gy_flag_data_ready_get(stmdev_ctx_t *ctx,
                                          uint8_t *val);

int32_t ism330dhcx_temp_flag_data_ready_get(stmdev_ctx_t *ctx,
                                            uint8_t *val);

int32_t ism330dhcx_xl_usr_offset_x_set(stmdev_ctx_t *ctx,
                                       uint8_t *buff);
int32_t ism330dhcx_xl_usr_offset_x_get(stmdev_ctx_t *ctx,
                                       uint8_t *buff);

int32_t ism330dhcx_xl_usr_offset_y_set(stmdev_ctx_t *ctx,
                                       uint8_t *buff);
int32_t ism330dhcx_xl_usr_offset_y_get(stmdev_ctx_t *ctx,
                                       uint8_t *buff);

int32_t ism330dhcx_xl_usr_offset_z_set(stmdev_ctx_t *ctx,
                                       uint8_t *buff);
int32_t ism330dhcx_xl_usr_offset_z_get(stmdev_ctx_t *ctx,
                                       uint8_t *buff);

